#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.container_apps.module.reminder_ca_itn_01.azurerm_container_app.this: Refreshing stat
Error: retrieving secrets for Container App (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-com-rg-01"
Container App Name: "io-p-itn-com-reminder-ca-01"): unexpected status 403 (403 Forbidden) with error: AuthorizationFailed: The client 'f520831b-0630-4689-8a34-492fb28689a6' with object id 'f520831b-0630-4689-8a34-492fb28689a6' does not have authorization to perform action 'Microsoft.App/containerApps/listSecrets/action' over scope '/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/containerApps/io-p-itn-com-reminder-ca-01' or the scope is invalid. If access was recently granted, please refresh your credentials.

  with module.container_apps.module.reminder_ca_itn_01.azurerm_container_app.this,
  on .terraform/modules/container_apps.reminder_ca_itn_01/container_app.tf line 1, in resource "azurerm_container_app" "this":
   1: resource "azurerm_container_app" "this" {

retrieving secrets for Container App (Subscription:
"ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-com-rg-01"
Container App Name: "io-p-itn-com-reminder-ca-01"): unexpected status 403
(403 Forbidden) with error: AuthorizationFailed: The client
'f520831b-0630-4689-8a34-492fb28689a6' with object id
'f520831b-0630-4689-8a34-492fb28689a6' does not have authorization to perform
action 'Microsoft.App/containerApps/listSecrets/action' over scope
'/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/containerApps/io-p-itn-com-reminder-ca-01'
or the scope is invalid. If access was recently granted, please refresh your
credentials.
e... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/containerApps/io-p-itn-com-reminder-ca-01]
module.web_apps.module.citizen_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.etl_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # azurerm_role_assignment.infra_cd_rgs_ca_contributor will be created
  + resource "azurerm_role_assignment" "infra_cd_rgs_ca_contributor" {
      + condition_version                = (known after apply)
      + description                      = "Allow Infra CD identity to write Container App configuration at monorepository resource group scope"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fc9dd549-51dc-4655-b1ce-7429617e37f8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Container Apps Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.infra_ci_rgs_ca_operator will be created
  + resource "azurerm_role_assignment" "infra_ci_rgs_ca_operator" {
      + condition_version                = (known after apply)
      + description                      = "Allow Infra CI identity to read Container App configuration at monorepository resource group scope"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f520831b-0630-4689-8a34-492fb28689a6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Container Apps Operator"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.citizen_func_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-com-citizen-as-01"
        name                = "io-p-itn-com-citizen-as-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ profile {
            name = jsonencode(
                {
                    for  = "low_load_profile"
                    name = "default"
                }
            )

          ~ capacity {
              ~ minimum = 3 -> 6
                # (2 unchanged attributes hidden)
            }

          ~ rule {
              ~ metric_trigger {
                  ~ threshold                = 25 -> 80
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ threshold                = 10 -> 20
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
